// Напишите программу, которая  на вход принимает число,  выдает его квадат (число умноженное само на себя)

// string number = Console.ReadLine();
// Console.WriteLine(number);

// int number = int.Parse(Console.ReadLine());
// number +=1;
// Console.WriteLine(number);


int number = int.Parse(Console.ReadLine());

int quarter = number * number;

Console.WriteLine(quarter);
